app/Controllers/Admin/Auth.php

SELECT *
FROM `users`
WHERE   (
`email` = 'sirvonmagbitang@gmail.com'
OR `username` = 'sirvonmagbitang@gmail.com'
 )
 LIMIT 1
---
    public function attemptLogin()
    {
        $userModel = new UserModel();
        $login = $this->request->getPost('login');
        $password = $this->request->getPost('password');

        $user = $userModel->groupStart()
                          ->where('email', $login)
                          ->orWhere('username', $login)
                          ->groupEnd()
                          ->first();