app/Controllers/Admin/Category.php

SELECT *
FROM `categories`
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `category` = 'frappe'
---
    public function index()
    {
        $categoryModel = new CategoryModel();
        $productModel = new \App\Models\ProductModel();

        $categories = $categoryModel->findAll();
        foreach ($categories as &$cat) {
            $cat['product_count'] = $productModel->where('category', $cat['slug'])->countAllResults();

SELECT *
FROM `categories`
WHERE `categories`.`id` = '4'
---
    public function edit($id)
    {
        $categoryModel = new CategoryModel();
        $category = $categoryModel->find($id);