app/Controllers/Admin/Dashboard.php

SELECT SUM(`total_amount`) AS `total_amount`
FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT `orders`.*, `users`.`username`, `users`.`email`, `users`.`first_name`, `users`.`last_name`
FROM `orders`
LEFT JOIN `users` ON `users`.`id` = `orders`.`user_id`
ORDER BY `orders`.`created_at` DESC
 LIMIT 10
---
    public function index()
    {
        $orderModel   = new OrderModel();
        $productModel = new ProductModel();
        $userModel    = new UserModel();

        $totalRevenue = $orderModel->selectSum('total_amount')->get()->getRowArray()['total_amount'] ?? 0;
        $totalOrders  = $orderModel->countAllResults();
        $totalProducts = $productModel->where('status', 'active')->countAllResults();
        $totalUsers   = $userModel->countAllResults();

        $recentOrders = $orderModel
            ->select('orders.*, users.username, users.email, users.first_name, users.last_name')
            ->join('users', 'users.id = orders.user_id', 'left')
            ->orderBy('orders.created_at', 'DESC')
            ->limit(10)
            ->findAll();