app/Controllers/Admin/Order.php

    public function index()
    {
        $orderModel = new OrderModel();

        $orders = $orderModel->select('orders.*, users.username, users.email')
                             ->join('users', 'users.id = orders.user_id', 'left')
                             ->orderBy('orders.created_at', 'DESC')
                             ->findAll();
---
SELECT `orders`.*, `users`.`username`, `users`.`email`
FROM `orders`
LEFT JOIN `users` ON `users`.`id` = `orders`.`user_id`
ORDER BY `orders`.`created_at` DESC