app/Controllers/Admin/Product.php

    public function index()
    {
        $productModel = new ProductModel();
        $data = [
            'title'      => 'Product Management - Admin',
            'page_title' => 'Product Management',
            'products'   => $productModel->orderBy('name', 'ASC')->findAll()
---
SELECT *
FROM `products`
ORDER BY `name` ASC

    public function create()
    {
        $categoryModel = new CategoryModel();
        return view('admin/products_form', [
            'title' => 'Add New Product',
            'categories' => $categoryModel->where('status', 'active')->findAll()
---
SELECT *
FROM `categories`
WHERE `status` = 'active'