app/Controllers/Admin/Review.php

    public function index()
    {
        $reviewModel = new ReviewModel();

        $data = [
            'title' => 'Manage Reviews - NextCafe Admin',
            'page_title' => 'Product Reviews',
            'reviews' => $reviewModel->select('reviews.*, users.username, products.name as product_name')
                                     ->join('users', 'users.id = reviews.user_id')
                                     ->join('products', 'products.id = reviews.product_id')
                                     ->orderBy('reviews.created_at', 'DESC')
                                     ->findAll()
---
SELECT `reviews`.*, `users`.`username`, `products`.`name` as `product_name`
FROM `reviews`
JOIN `users` ON `users`.`id` = `reviews`.`user_id`
JOIN `products` ON `products`.`id` = `reviews`.`product_id`
ORDER BY `reviews`.`created_at` DESC