app/Controllers/Admin/User.php

    public function index()
    {
        $userModel = new UserModel();
        $data = [
            'title'      => 'Users Management - Admin',
            'page_title' => 'Users Management',
            'users'      => $userModel->orderBy('created_at', 'DESC')->findAll()
---
SELECT *
FROM `users`
ORDER BY `created_at` DESC