app/Views/layout/main.php

SELECT COUNT(*) AS `numrows`
FROM `cart`
WHERE `user_id` = '9'
---
                <i class="bi bi-cart3"></i> My Cart
                <?php if (session()->get('isLoggedIn')): ?>
                    <?php
                        $cartCount = (new \App\Models\CartModel())->where('user_id', session()->get('id'))->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `wishlist`
WHERE `user_id` = '9'
---
                <i class="bi bi-heart"></i> My Wishlist
                <?php if (session()->get('isLoggedIn')): ?>
                    <?php
                        $wishlistCount = (new \App\Models\WishlistModel())->where('user_id', session()->get('id'))->countAllResults();