app/Controllers/Home.php

SELECT *
FROM `products`
 LIMIT 4
SELECT *
FROM `categories`
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('login');
        }

        $productModel = new ProductModel();
        $categoryModel = new CategoryModel();

        $data = [
            'title' => 'Welcome to NextCafe - Finest Brewed Coffee',
            'products' => $productModel->limit(4)->find(),
            'categories' => $categoryModel->findAll(),