app/Controllers/Product.php

SELECT *
FROM `products`
WHERE `category` = 'pastries'
AND `status` = 'active'
ORDER BY `id` DESC
SELECT *
FROM `products`
WHERE `status` = 'active'
ORDER BY `id` DESC
SELECT *
FROM `categories`
WHERE `status` = 'active'
---
                break;
        }

        $data = [
            'title' => 'Our Menu - NextCafe',
            'products' => $productModel->where('status', 'active')->findAll(),
            'categories' => $categoryModel->where('status', 'active')->findAll(),
            'category_id' => $categorySlug,
            'search_query' => $search,
            'sort_param' => $sort
        ];