app/Controllers/User.php

    public function orders()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('login');
        }

        $orderModel = new OrderModel();
        $orderItemModel = new OrderItemModel();

        // Get orders for the logged-in user
        $orders = $orderModel->where('user_id', session()->get('id'))
                            ->orderBy('created_at', 'DESC')
                            ->findAll();

        // For each order, get its items with product details
        foreach ($orders as &$order) {
            $order['items'] = $orderItemModel->select('order_items.*, products.name as product_name, products.image as product_image')
                                            ->join('products', 'products.id = order_items.product_id')
                                            ->where('order_id', $order['id'])
                                            ->findAll();
---
SELECT *
FROM `orders`
WHERE `user_id` = '9'
ORDER BY `created_at` DESC
SELECT `order_items`.*, `products`.`name` as `product_name`, `products`.`image` as `product_image`
FROM `order_items`
JOIN `products` ON `products`.`id` = `order_items`.`product_id`
WHERE `order_id` = '2'