app/Models/WishlistModel.php

SELECT `wishlist`.*, `products`.`name` as `product_name`, `products`.`price` as `product_price`, `products`.`image` as `product_image`, `products`.`description` as `product_description`
FROM `wishlist`
JOIN `products` ON `products`.`id` = `wishlist`.`product_id`
WHERE `wishlist`.`user_id` = '9'
---
    public function getWishlistWithProducts($userId)
    {
        return $this->select('wishlist.*, products.name as product_name, products.price as product_price, products.image as product_image, products.description as product_description')
                    ->join('products', 'products.id = wishlist.product_id')
                    ->where('wishlist.user_id', $userId)
                    ->findAll();