app/Views/home.php

    $wishlistIds = [];
    if (session()->get('isLoggedIn')) {
        $wishlistModel = new \App\Models\WishlistModel();
        $wishlistIds = array_column($wishlistModel->where('user_id', session()->get('id'))->findAll(), 'product_id');
---
SELECT *
FROM `wishlist`
WHERE `user_id` = '9'