app/Views/menu.php

SELECT *
FROM `wishlist`
WHERE `user_id` = '9'
---
    $wishlistIds = [];
    if (session()->get('isLoggedIn')) {
        $wishlistModel = new \App\Models\WishlistModel();
        $wishlistIds = array_column($wishlistModel->where('user_id', session()->get('id'))->findAll(), 'product_id');